package de.telran.geork.homeworks.hw2.theory;

public class Theory {
    /*
        1.	Разрешено ли множественное наследование в Java?
            •Нет
        2.	Что такое абстракция? какой класс является абстрактным?
            •	Абстракция означает использование простых вещей для описания чего-то сложного.
            •	Если класс содержит хотя бы один абстрактный метод, то обязательно следует объявить класс абстрактным.
            •	Абстрактные классы призваны предоставлять базовый функционал для классов-наследников.
        3.	Что такое полиморфизм своими словами
            •	Один метод но разная реализация
        4.	Что делать, если хочется наследоваться от 2 классов?
            •	эти два класса должны наследоваться один от друга и потом наследоваться  до третьего
        5.	Можем ли мы создать экземпляр абстрактного класса?
            •	Нет
        6.	Можно ли добавлять конструкторы в абстрактный класс?
            •	Да


     */
}
