package de.telran.geork.homeworks.hw1.karagudjanov.geork;

public class Theory {

    /*
    1.	Что такое class и в чем отличие от object?
        •	Class - это шаблон для создания объекта.
        •	Object - это экземпляр класса.

    2.	Для чего нужны packages и что такое import?
        •	Package – for collect files of project
        •	Import – сообщает компилятору Java, где найти классы, на которые ссылается код.

    3.	Как следует называть имена классов и методов? Где можно найти документацию?
        •	Имена классов – the first letter of each internal word capitalized
        •	Имена методов – should be verbs, in mixed case with the first letter lowercase,
                            with the first letter of each internal word capitalized.
        •	Java code conventions
            (https://www.oracle.com/java/technologies/javase/codeconventions-namingconventions.html)

    4.	Есть ли ограничение по количеству конструкторов в классе?
        •	Нет

    5.	Что будет, если не указать ни одного конструктора в классе?
        •	Компилятор создаст конструктор по умолчанию без параметров для этого класса.

    6.	Для чего нужен this?
        •	This - представляет ссылку на текущий экземпляр класса.

    7.	Что такое инкапсуляция и какие способы его достижения существуют в java?
        •	Объединение данных и методов работы с этими данными в одной упаковке («капсуле»).

    8.	Какие модификаторы доступа существуют? коротко опишите каждый из них
        •	Private - доступен только из кода в том же классе.
        •	Default - видны всем классам в текущем пакете.
        •	Protected - доступен из любого места в текущем классе или пакете или в производных классах,
                        даже если они находятся в других пакетах
        •	Public - видны другим классам из текущего пакета и из внешних пакетов.

    9.	Для чего нужны геттеры и сеттеры?
        •	Геттер - возвращает нам значение какого-то поля.
        •	Сеттер – изменяет значение поля.

     */
}
