package de.telran.geork.homeworks.hw6;

public class Theory {
    /*
    1.	Что такое Set/List/Queue и для чего они нужны? это интерфейсы или классы?
        •	Set: это интерфейс, нелинейной структуры данных, не имеющий дубликатов и порядка.
        •	List: это интерфейс, линейной структуры данных, который сохраняет последовательность добавления элементов и позволяет осуществлять доступ к элементу по индексу.
        •	Queue: это интерфейс, линейной структуры данных, представляет собой список с дисциплиной "первый вошел, первый вышел" (FIFO).
    2.	Что такое ArrayList?
        •	Это класс. Реализация изменяемого массива интерфейса List, который отвечает за список (или динамический массив), возможность добавлять и удалять элементы, при этом будет увеличиваться или уменьшаться по мере необходимости.
    3.	Что гарантирует Set? Что не гарантирует?
        •	Гарантирует: список без дубликатов
        •	Не гарантирует: порядок списка
    4.	Что не гарантирует List? Что гарантирует?
        •	Гарантирует:
        •	Не гарантирует:
    5.	Что стоит во главе иерархии Java Collection Framework?
        •	Интерфейс Iterable
    6.	Какой вспомогательный класс есть для работы с массивами?
        •	Collections
    7.	Можно ли написать следующую конструкцию? Collection<int> col = new ArrayList<>();
        •	Нет
        •	Да, если заменим int to Integer.
    8.	В чем разница между двумя подходами?
        •	For быстрее чем for each
            for (int i = 0; i < array.length; i++) {
            //тут логика
            }

            for (int i : array) {
                //тут логика
            }

     */
}
