package de.telran.geork.homeworks.hw3;

public class Theory {
    /*
        1.	Что такое интерфейс?
            •	Это конструкция языка Java, в рамках которой принято описывать абстрактные публичные методы и статические константы.
            •	Интерфейс определяет некоторый функционал, не имеющий конкретной реализации, который затем реализуют классы.
        2.	Что такое сигнатура метода?
            •	Это имя метода плюс параметры, порядок параметров имеет значение.
        3.	Может ли быть 2 метода с одинаковой сигнатурой внутри одного класса?
            •	Нет
        4.	В чем разница между переопределением (Override) и перегрузкой(Overload)?
            •	Override: когда метод один, но разная реализация. Версия выполняемого метода будет определяться объектом, который используется для его вызова.
            •	Overload: Когда имеется несколько методов с одинаковыми именами, но разными параметрами.
        5.	Можно ли имплементировать несколько интерфейсов?
            •	Да
        6.	В чем отличие интерфейса от абстрактного класса?
            •	Интерфейс описывает только поведение. У него нет состояния. А у абстрактного класса состояние есть: он описывает и то, и другое.
            •	Классы могут реализовывать сколько угодно интерфейсов, но наследоваться можно только от одного класса
        7.	Что такое enum?
            •	Перечисление специальный тип данных, который позволяет переменной быть набором предопределенных констант.
        8.	Какое правило наименование переменных в enum?
            •	Также, как и константы: “NAME_NAME”
        9.	Можно ли у наследоваться от какого-то класса в enum? что по поводу interface?
            •	У наследоваться не можно
            •	От интерфейса можно

        */
}
