package de.telran.geork.homeworks.hw5;

public class Theory {
    /*
Теория
    1.	Где хранится объект?
        •	В куче
    2.	Когда удаляется объект?
        •	Объекты автоматически уничтожаются "сборщиком мусора" в процессе работы JVM, когда отсутствует ссылка на него в программе.
    3.	Когда удаляется метод из стека?
        •	После выполнения метода
    4.	Где хранятся примитивные переменные метода? примитивные переменные объекта
        •	Примитивные переменные метода - стек
        •	Примитивные переменные объекта - куча
    5.	Что работает быстрее куча или стек?
        •	Стек
    6.	Как передается примитив в метод? как передается ссылочный тип в метод
        •	Примитив передается по значению.
        •	Ссылочный тип передается по ссылке
    7.	Почему в массиве нельзя изменить размер после создания?
        •	Потому что при создании массива выделяться указанное место в куче
    8.	Как можно увеличить размер массива, если хочется?
        •	Нужна создать новый массив и указать желаемый размер а потом копировать туда старый
    9.	Что такое двумерный/трехмерный массив?
        •	Двумерный: это когда элемент одного массива ссылается на новый массив
        •	Трехмерный: это когда элемент одного массива ссылается на новый массива а элемент нового массива ссылается на другой массив
    10.	Что является номером строки, а что номером столбца в записи вида a[8][4]
        •	Номер строки 8
        •	Номер столбца 4


     */
}
