package de.telran.geork.homeworks.hw4;

public class Theory {

    /*
    1.	Что является объектом в java?
        •	Array
        •	Class
        •	Interface
        •	String
        •	Enum
    2.	Как определяется какой метод будет вызван в случае передачи туда примитива? объекта?
         •	/
    3.	Что такое autoboxing и unboxing?
        •	Autoboxing: primitive to Object
        •	Unboxing: Object to primitive
    4.	Почему не стоить сравнивать через ==
        •	Если адрес памяти (ссылка) обоих объектов один и тот же, объекты равны. Не сравнивает содержимое объекта.
    5.	Сколько весит в памяти ссылка?
        •	8 bytes
    6.	Почему объекты называются ссылочными типами данных?
        •	Для создания нового объекта выделяется память и возвращается ссылка на этот объект в памяти

     */
}
