package de.telran.geork.homeworks.hw8;

public class Theory {
    /*
     1.	В чем концептуальная разница между LinkedList и ArrayList?
        •	ArrayList - это список на основе массива.
        •	LinkedList - связанный список на основе элементов и связи между ними.
    2.	Для каких задач лучше выбрать LinkedList, а когда ArrayList?
        •	ArrayList подходит для работы с коллекцией, доступной только для чтения.
        •	LinkedList подходит для работы с коллекцией, допускающей различные модификации данных, такие как добавление и удаление.
    3.	Какую информацию хранит каждая Node в LinkedList?
        •	Содержит ссылки на предыдущий и следующий элементы.
    4.	Можем ли мы добавить null в LinkedList?
        •	да
    5.  Какая сложность вставки и удаления в LinkedList? какая у ArrayList?
                            ArrayList	LinkedList
         add (в начало)	        O(n)	O(1)
         add (в середину)	    O(n)	O(n)
         add (в конец списка)	O(n)	O(1)
     */
}
